uleemos/nuttx/arch/risc-v/src/esp32p4/esp32p4_mipi_dsi.c
/****************************************************************************
 * arch/risc-v/src/esp32p4/esp32p4_mipi_dsi.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <inttypes.h>
#include <stdint.h>
#include <stdbool.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <errno.h>
#include <debug.h>

#include <nuttx/arch.h>
#include <nuttx/kmalloc.h>
#include <nuttx/mutex.h>
#include <nuttx/video/fb.h>

#include "esp_cache.h"
#include "hal/mipi_dsi_hal.h"
#include "hal/mipi_dsi_ll.h"
#include "hal/mipi_dsi_host_ll.h"
#include "hal/mipi_dsi_brg_ll.h"
#include "hal/mipi_dsi_phy_ll.h"
#include "hal/dw_gdma_hal.h"
#include "hal/dw_gdma_ll.h"
#include "hal/dw_gdma_types.h"
#include "hal/ldo_ll.h"
#include "hal/clk_gate_ll.h"
#include "esp_private/periph_ctrl.h"
#include "soc/hp_sys_clkrst_struct.h"
#include "soc/pmu_struct.h"
#include "soc/reg_base.h"

#include "esp32p4_mipi_dsi.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define DSI_REF_CLK_HZ           40000000UL /* 40 MHz XTAL */
#define DSI_DPI_SRC_CLK_MHZ      240.0f     /* 240 MHz PLL */
#define DSI_DMA_CHANNEL          3          /* CSI=0, PPA=0..2 */
#define DSI_MIPI_PHY_LDO_UNIT    2          /* LDO channel 3 */
#define DSI_MIPI_PHY_LDO_MV      2500
#define DSI_PHY_READY_TIMEOUT_US 100000
#define DSI_CMD_TIMEOUT_US       100000

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct esp32p4_dsi_dev_s
{
  struct fb_vtable_s          vtable;
  mipi_dsi_hal_context_t      hal;
  dw_gdma_hal_context_t       dma_hal;
  struct esp32p4_dsi_config_s config;
  mutex_t                     lock;
  FAR uint8_t                *fb_mem;
  size_t                      fb_size;
  bool                        streaming;
  bool                        dma_initialized;
  bool                        initialized;
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static int esp32p4_fb_getvideoinfo(FAR struct fb_vtable_s *vtable,
                                   FAR struct fb_videoinfo_s *vinfo);
static int esp32p4_fb_getplaneinfo(FAR struct fb_vtable_s *vtable,
                                   int planeno,
                                   FAR struct fb_planeinfo_s *pinfo);
static int esp32p4_fb_open(FAR struct fb_vtable_s *vtable);
static int esp32p4_fb_close(FAR struct fb_vtable_s *vtable);
static int esp32p4_fb_pandisplay(FAR struct fb_vtable_s *vtable,
                                 FAR struct fb_planeinfo_s *pinfo);
static int esp32p4_fb_ioctl(FAR struct fb_vtable_s *vtable,
                            int cmd, unsigned long arg);

/****************************************************************************
 * Private Data
 ****************************************************************************/

static struct esp32p4_dsi_dev_s g_dsi_dev =
{
  .vtable =
  {
    .getvideoinfo = esp32p4_fb_getvideoinfo,
    .getplaneinfo = esp32p4_fb_getplaneinfo,
    .open         = esp32p4_fb_open,
    .close        = esp32p4_fb_close,
    .pandisplay   = esp32p4_fb_pandisplay,
    .ioctl        = esp32p4_fb_ioctl,
  },
  .lock           = NXMUTEX_INITIALIZER,
  .fb_mem         = NULL,
  .fb_size        = 0,
  .streaming      = false,
  .dma_initialized = false,
  .initialized    = false,
};

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp32p4_dsi_enable_clocks
 ****************************************************************************/

static void esp32p4_dsi_enable_clocks(uint32_t div)
{
  uint8_t dref = 0;
  uint8_t mul = 0;
  bool use_rail_voltage = false;

  /* CSI and DSI share LDO_VO3.  Re-enabling the configured rail is safe and
   * makes display initialization independent from camera initialization.
   */

  ldo_ll_voltage_to_dref_mul(DSI_MIPI_PHY_LDO_UNIT,
                             DSI_MIPI_PHY_LDO_MV,
                             &dref, &mul, &use_rail_voltage);
  ldo_ll_adjust_voltage(DSI_MIPI_PHY_LDO_UNIT, dref, mul,
                        use_rail_voltage);
  ldo_ll_set_owner(DSI_MIPI_PHY_LDO_UNIT, LDO_LL_UNIT_OWNER_SW);
  ldo_ll_enable_ripple_suppression(DSI_MIPI_PHY_LDO_UNIT, true);
  ldo_ll_enable(DSI_MIPI_PHY_LDO_UNIT, true);
  up_udelay(5000);

  PERIPH_RCC_ATOMIC()
    {
      clk_gate_ll_ref_20m_clk_en(true);
      mipi_dsi_ll_enable_bus_clock(0, true);
      mipi_dsi_ll_reset_register(0);
      mipi_dsi_ll_set_phy_config_clock_source(
        0, MIPI_DSI_PHY_CFG_CLK_SRC_PLL_F20M);
      mipi_dsi_ll_enable_phy_config_clock(0, true);
      mipi_dsi_ll_set_phy_pllref_clock_source(
        0, MIPI_DSI_PHY_PLLREF_CLK_SRC_XTAL);
      mipi_dsi_ll_set_phy_pll_ref_clock_div(0, 1);
      mipi_dsi_ll_enable_phy_pllref_clock(0, true);
      mipi_dsi_ll_set_dpi_clock_source(0,
                                      MIPI_DSI_DPI_CLK_SRC_PLL_F240M);
      mipi_dsi_ll_set_dpi_clock_div(0, div);
      mipi_dsi_ll_enable_dpi_clock(0, true);
    }
}

static int esp32p4_dsi_wait_phy_ready(FAR struct esp32p4_dsi_dev_s *priv)
{
  unsigned int elapsed;

  for (elapsed = 0; elapsed < DSI_PHY_READY_TIMEOUT_US; elapsed += 100)
    {
      if (mipi_dsi_phy_ll_is_pll_locked(priv->hal.host) &&
          mipi_dsi_phy_ll_are_lanes_stopped(priv->hal.host,
                                             priv->config.num_lanes))
        {
          return OK;
        }

      up_udelay(100);
    }

