uleemos/nuttx/arch/risc-v/src/esp32p4/esp32p4_mipi_dsi.c
  return -ETIMEDOUT;
}

static int esp32p4_dsi_configure_dma(FAR struct esp32p4_dsi_dev_s *priv)
{
  dw_gdma_dev_t *dev;
  uint32_t beats;

  if (priv->fb_mem == NULL || priv->fb_size == 0 ||
      (priv->fb_size % sizeof(uint64_t)) != 0)
    {
      return -EINVAL;
    }

  PERIPH_RCC_ATOMIC()
    {
      dw_gdma_ll_enable_bus_clock(0, true);
    }

  priv->dma_hal.dev = DW_GDMA_LL_GET_HW(0);
  dev = priv->dma_hal.dev;
  beats = priv->fb_size / sizeof(uint64_t);

  dw_gdma_ll_enable_controller(dev, true);
  dw_gdma_ll_channel_enable(dev, DSI_DMA_CHANNEL, false);
  dw_gdma_ll_channel_clear_intr(dev, DSI_DMA_CHANNEL, UINT32_MAX);
  dw_gdma_ll_channel_set_priority(dev, DSI_DMA_CHANNEL, 3);
  dw_gdma_ll_channel_set_trans_flow(dev, DSI_DMA_CHANNEL,
                                    DW_GDMA_ROLE_MEM,
                                    DW_GDMA_ROLE_PERIPH_DSI,
                                    DW_GDMA_FLOW_CTRL_SELF);
  dw_gdma_ll_channel_set_src_handshake_interface(dev, DSI_DMA_CHANNEL,
                                                 DW_GDMA_HANDSHAKE_HW);
  dw_gdma_ll_channel_set_dst_handshake_interface(dev, DSI_DMA_CHANNEL,
                                                 DW_GDMA_HANDSHAKE_HW);
  dw_gdma_ll_channel_set_dst_handshake_periph(dev, DSI_DMA_CHANNEL,
                                              DW_GDMA_ROLE_PERIPH_DSI);
  dw_gdma_ll_channel_set_src_multi_block_type(dev, DSI_DMA_CHANNEL,
                                              DW_GDMA_BLOCK_TRANSFER_RELOAD);
  dw_gdma_ll_channel_set_dst_multi_block_type(dev, DSI_DMA_CHANNEL,
                                              DW_GDMA_BLOCK_TRANSFER_RELOAD);
  dw_gdma_ll_channel_set_src_addr(dev, DSI_DMA_CHANNEL,
                                  (uint32_t)(uintptr_t)priv->fb_mem);
  dw_gdma_ll_channel_set_dst_addr(dev, DSI_DMA_CHANNEL,
                                  MIPI_DSI_BRG_MEM_BASE);
  dw_gdma_ll_channel_set_trans_block_size(dev, DSI_DMA_CHANNEL, beats);
  dw_gdma_ll_channel_set_src_master_port(dev, DSI_DMA_CHANNEL,
                                         (uintptr_t)priv->fb_mem);
  dw_gdma_ll_channel_set_dst_master_port(dev, DSI_DMA_CHANNEL,
                                         MIPI_DSI_BRG_MEM_BASE);
  dw_gdma_ll_channel_set_src_trans_width(dev, DSI_DMA_CHANNEL,
                                         DW_GDMA_TRANS_WIDTH_64);
  dw_gdma_ll_channel_set_dst_trans_width(dev, DSI_DMA_CHANNEL,
                                         DW_GDMA_TRANS_WIDTH_64);
  dw_gdma_ll_channel_set_src_burst_items(dev, DSI_DMA_CHANNEL,
                                         DW_GDMA_BURST_ITEMS_512);
  dw_gdma_ll_channel_set_dst_burst_items(dev, DSI_DMA_CHANNEL,
                                         DW_GDMA_BURST_ITEMS_256);
  dw_gdma_ll_channel_set_src_burst_mode(dev, DSI_DMA_CHANNEL,
                                        DW_GDMA_BURST_MODE_INCREMENT);
  dw_gdma_ll_channel_set_dst_burst_mode(dev, DSI_DMA_CHANNEL,
                                        DW_GDMA_BURST_MODE_FIXED);
  dw_gdma_ll_channel_set_src_burst_len(dev, DSI_DMA_CHANNEL, 16);
  dw_gdma_ll_channel_set_dst_burst_len(dev, DSI_DMA_CHANNEL, 16);
  dw_gdma_ll_channel_set_block_markers(dev, DSI_DMA_CHANNEL,
                                       false, false, true);
  dw_gdma_ll_channel_enable_intr_propagation(dev, DSI_DMA_CHANNEL,
                                             UINT32_MAX, false);
  priv->dma_initialized = true;

  return OK;
}

/****************************************************************************
 * Name: esp32p4_fb_getvideoinfo
 ****************************************************************************/

static int esp32p4_fb_getvideoinfo(FAR struct fb_vtable_s *vtable,
                                   FAR struct fb_videoinfo_s *vinfo)
{
  FAR struct esp32p4_dsi_dev_s *priv = &g_dsi_dev;

  if (vinfo == NULL)
    {
      return -EINVAL;
    }

  vinfo->fmt     = (priv->config.color_format == ESP32P4_DSI_COLOR_RGB888) ?
                   FB_FMT_RGB24 : FB_FMT_RGB16_565;
  vinfo->xres    = priv->config.timing.width;
  vinfo->yres    = priv->config.timing.height;
  vinfo->nplanes = 1;

  return OK;
}

/****************************************************************************
 * Name: esp32p4_fb_getplaneinfo
 ****************************************************************************/

static int esp32p4_fb_getplaneinfo(FAR struct fb_vtable_s *vtable,
                                   int planeno,
                                   FAR struct fb_planeinfo_s *pinfo)
{
  FAR struct esp32p4_dsi_dev_s *priv = &g_dsi_dev;
  uint8_t bpp;

  if (pinfo == NULL || planeno != 0)
    {
      return -EINVAL;
    }

  bpp = (priv->config.color_format == ESP32P4_DSI_COLOR_RGB888) ? 24 : 16;

  pinfo->fbmem  = priv->fb_mem;
  pinfo->fblen  = priv->fb_size;
  pinfo->stride = priv->config.timing.width * (bpp / 8);
  pinfo->display = 0;
  pinfo->bpp    = bpp;

  return OK;
}

/****************************************************************************
 * Name: esp32p4_fb_open
 ****************************************************************************/

static int esp32p4_fb_open(FAR struct fb_vtable_s *vtable)
{
  return OK;
}

/****************************************************************************
 * Name: esp32p4_fb_close
 ****************************************************************************/

static int esp32p4_fb_close(FAR struct fb_vtable_s *vtable)
{
  return OK;
}

/****************************************************************************
 * Name: esp32p4_fb_pandisplay
 ****************************************************************************/

static int esp32p4_fb_pandisplay(FAR struct fb_vtable_s *vtable,
                                 FAR struct fb_planeinfo_s *pinfo)
{
  FAR struct esp32p4_dsi_dev_s *priv = &g_dsi_dev;

  if (pinfo == NULL || pinfo->fbmem == NULL)
    {
      return -EINVAL;
    }

  nxmutex_lock(&priv->lock);
  priv->fb_mem = (FAR uint8_t *)pinfo->fbmem;

  /* Flush cache for the updated framebuffer memory */

  esp_cache_msync((void *)priv->fb_mem, priv->fb_size,
                  ESP_CACHE_MSYNC_FLAG_DIR_C2M);
  nxmutex_unlock(&priv->lock);

  return OK;
}

/****************************************************************************
 * Name: esp32p4_fb_ioctl
 ****************************************************************************/

static int esp32p4_fb_ioctl(FAR struct fb_vtable_s *vtable,
                            int cmd, unsigned long arg)
{
  FAR struct esp32p4_dsi_dev_s *priv = &g_dsi_dev;
  int ret = OK;

