uleemos/nuttx/arch/risc-v/src/esp32p4/esp32p4_mipi_dsi.c
  switch (cmd)
    {
      case FBIOPAN_DISPLAY:
        ret = esp32p4_fb_pandisplay(vtable,
                                    (FAR struct fb_planeinfo_s *)arg);
        break;

      case FBIOSET_POWER:

        /* Optional power control */

        break;

      default:
        ginfo("Unsupported FB ioctl: 0x%04x\n", cmd);
        ret = -ENOTTY;
        break;
    }

  return ret;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp32p4_mipi_dsi_initialize
 ****************************************************************************/

int esp32p4_mipi_dsi_initialize(
    FAR const struct esp32p4_dsi_config_s *config)
{
  FAR struct esp32p4_dsi_dev_s *priv = &g_dsi_dev;
  mipi_dsi_hal_config_t hal_cfg;
  uint32_t div;
  uint32_t bits_per_pixel;
  lcd_color_format_t color_fmt;
  int ret;

  if (config == NULL)
    {
      return -EINVAL;
    }

  nxmutex_lock(&priv->lock);

  memcpy(&priv->config, config, sizeof(struct esp32p4_dsi_config_s));

  /* 1. Calculate clock divider for DPI */

  div = (uint32_t)(DSI_DPI_SRC_CLK_MHZ / config->timing.dpi_clk_mhz);
  if (div == 0)
    {
      div = 1;
    }

  esp32p4_dsi_enable_clocks(div);

  /* 2. Initialize HAL context */

  hal_cfg.bus_id             = 0;
  hal_cfg.lane_bit_rate_mbps = config->lane_bit_rate_mbps;
  hal_cfg.num_data_lanes     = config->num_lanes;

  mipi_dsi_hal_init(&priv->hal, &hal_cfg);

  /* Keep the bridge register and FIFO clocks running during early bring-up.
   * This also prevents a first-burst stall while the DPI path is empty.
   */

  mipi_dsi_brg_ll_force_enable_reg_clock(priv->hal.bridge, true);
  mipi_dsi_brg_ll_enable_ref_clock(priv->hal.bridge, true);
  priv->hal.bridge->mem_clk_ctrl.dsi_bridge_mem_clk_force_on = 1;
  priv->hal.bridge->mem_clk_ctrl.dsi_mem_clk_force_on = 1;

  /* 3. Configure D-PHY TX PLL */

  mipi_dsi_hal_configure_phy_pll(&priv->hal, DSI_REF_CLK_HZ,
                                 config->lane_bit_rate_mbps);

  ret = esp32p4_dsi_wait_phy_ready(priv);
  if (ret < 0)
    {
      nxmutex_unlock(&priv->lock);
      return ret;
    }

  /* Command mode is used for EK79007 initialization before video starts. */

  mipi_dsi_host_ll_enable_video_mode(priv->hal.host, false);
  mipi_dsi_host_ll_set_clock_lane_state(
    priv->hal.host, MIPI_DSI_LL_CLOCK_LANE_STATE_AUTO);
  mipi_dsi_phy_ll_set_switch_time(priv->hal.host, 50, 104, 46, 128);
  mipi_dsi_host_ll_enable_rx_crc(priv->hal.host, true);
  mipi_dsi_host_ll_enable_rx_ecc(priv->hal.host, true);
  mipi_dsi_host_ll_enable_tx_eotp(priv->hal.host, true, false);
  mipi_dsi_host_ll_set_timeout_clock_division(
    priv->hal.host, (uint32_t)(config->lane_bit_rate_mbps / 80.0f + 0.5f));
  mipi_dsi_host_ll_set_escape_clock_division(
    priv->hal.host, (uint32_t)(config->lane_bit_rate_mbps / 144.0f + 0.5f));
  mipi_dsi_host_ll_set_timeout_count(priv->hal.host, 0, 0, 0, 0,
                                     0, 0, 0);
  mipi_dsi_phy_ll_set_max_read_time(priv->hal.host, 6000);
  mipi_dsi_phy_ll_set_stop_wait_time(priv->hal.host, 0x3f);

  mipi_dsi_host_ll_enable_te_ack(priv->hal.host, false);
  /* The EK79007 module does not return write acknowledgements during its
   * reset-time initialization.  Requesting ACK leaves the command buffered
   * while lane 0 waits in bus-turnaround direction.
   */

  mipi_dsi_host_ll_enable_cmd_ack(priv->hal.host, false);
  mipi_dsi_host_ll_enable_bta(priv->hal.host, false);
  mipi_dsi_host_ll_set_gen_short_wr_speed_mode(
    priv->hal.host, 0, MIPI_DSI_LL_TRANS_SPEED_LP);
  mipi_dsi_host_ll_set_gen_short_wr_speed_mode(
    priv->hal.host, 1, MIPI_DSI_LL_TRANS_SPEED_LP);
  mipi_dsi_host_ll_set_gen_short_wr_speed_mode(
    priv->hal.host, 2, MIPI_DSI_LL_TRANS_SPEED_LP);
  mipi_dsi_host_ll_set_gen_long_wr_speed_mode(
    priv->hal.host, MIPI_DSI_LL_TRANS_SPEED_LP);
  mipi_dsi_host_ll_set_dcs_short_wr_speed_mode(
    priv->hal.host, 0, MIPI_DSI_LL_TRANS_SPEED_LP);
  mipi_dsi_host_ll_set_dcs_short_wr_speed_mode(
    priv->hal.host, 1, MIPI_DSI_LL_TRANS_SPEED_LP);
  mipi_dsi_host_ll_set_dcs_long_wr_speed_mode(
    priv->hal.host, MIPI_DSI_LL_TRANS_SPEED_LP);

  /* 4. Configure horizontal and vertical video timing */

  mipi_dsi_hal_host_dpi_calculate_divider(&priv->hal, DSI_DPI_SRC_CLK_MHZ,
                                          config->timing.dpi_clk_mhz);

  mipi_dsi_hal_host_dpi_set_horizontal_timing(&priv->hal,
                                              config->timing.hsw,
                                              config->timing.hbp,
                                              config->timing.width,
                                              config->timing.hfp);

  mipi_dsi_hal_host_dpi_set_vertical_timing(&priv->hal,
                                            config->timing.vsw,
                                            config->timing.vbp,
                                            config->timing.height,
                                            config->timing.vfp);

  /* 5. Set Color format in Bridge */

  color_fmt = (config->color_format == ESP32P4_DSI_COLOR_RGB888) ?
              LCD_COLOR_FMT_RGB888 : LCD_COLOR_FMT_RGB565;
  bits_per_pixel = (config->color_format == ESP32P4_DSI_COLOR_RGB888) ?
                   24 : 16;

  mipi_dsi_host_ll_dpi_set_vcid(priv->hal.host, 0);
  mipi_dsi_host_ll_dpi_set_color_coding(priv->hal.host, color_fmt, 0);
  mipi_dsi_host_ll_dpi_set_timing_polarity(priv->hal.host, false, false,
                                            false, false, false);
  mipi_dsi_host_ll_dpi_enable_lp_horizontal_timing(priv->hal.host,
                                                    true, true);
  mipi_dsi_host_ll_dpi_enable_lp_vertical_timing(priv->hal.host,
                                                  true, true, true, true);
  mipi_dsi_host_ll_dpi_enable_lp_command(priv->hal.host, true);
  mipi_dsi_host_ll_dpi_enable_frame_ack(priv->hal.host, true);
  mipi_dsi_host_ll_dpi_set_video_burst_type(
    priv->hal.host, MIPI_DSI_LL_VIDEO_BURST_WITH_SYNC_PULSES);
  mipi_dsi_host_ll_dpi_set_video_packet_pixel_num(priv->hal.host,
                                                   config->timing.width);
  mipi_dsi_host_ll_dpi_set_trunks_num(priv->hal.host, 0);
  mipi_dsi_host_ll_dpi_set_null_packet_size(priv->hal.host, 0);

  mipi_dsi_brg_ll_set_input_color_format(priv->hal.bridge, color_fmt);
  mipi_dsi_brg_ll_set_output_color_format(priv->hal.bridge, color_fmt, 0);
  mipi_dsi_brg_ll_set_num_pixel_bits(priv->hal.bridge,
                                     config->timing.width *
                                     config->timing.height *
                                     bits_per_pixel);
  mipi_dsi_brg_ll_set_underrun_discard_count(priv->hal.bridge,
                                              config->timing.width);
  mipi_dsi_brg_ll_set_flow_controller(priv->hal.bridge,
                                      MIPI_DSI_LL_FLOW_CONTROLLER_DMA);
  mipi_dsi_brg_ll_set_multi_block_number(priv->hal.bridge, 1);
  mipi_dsi_brg_ll_set_burst_len(priv->hal.bridge, 256);
  mipi_dsi_brg_ll_set_empty_threshold(priv->hal.bridge, 1024 - 256);
  mipi_dsi_brg_ll_enable(priv->hal.bridge, true);
  mipi_dsi_brg_ll_update_dpi_config(priv->hal.bridge);

  priv->initialized = true;
  nxmutex_unlock(&priv->lock);

  ginfo("ESP32-P4 MIPI DSI initialized: %d lanes @ %.1f Mbps\n",
        config->num_lanes, config->lane_bit_rate_mbps);
  return OK;
}

/****************************************************************************
 * Name: esp32p4_mipi_dsi_write_dcs
 ****************************************************************************/

int esp32p4_mipi_dsi_write_dcs(uint8_t vc, uint8_t cmd,
                               FAR const void *param, uint16_t param_size)
{
  FAR struct esp32p4_dsi_dev_s *priv = &g_dsi_dev;
  unsigned int elapsed;
  int ret = OK;

