uleemos/nuttx/arch/risc-v/src/esp32p4/esp32p4_mipi_dsi.c
  if (!priv->initialized)
    {
      return -EPERM;
    }

  nxmutex_lock(&priv->lock);
  mipi_dsi_hal_host_gen_write_dcs_command(&priv->hal, vc, cmd, 1,
                                          param, param_size);

  /* The HAL queues commands asynchronously.  The panel setup sequence must
   * not switch the host into video mode while a command is still buffered.
   */

  for (elapsed = 0; elapsed < DSI_CMD_TIMEOUT_US; elapsed += 100)
    {
      if (priv->hal.host->cmd_pkt_status.gen_cmd_empty &&
          priv->hal.host->cmd_pkt_status.gen_pld_w_empty &&
          priv->hal.host->cmd_pkt_status.gen_buff_cmd_empty &&
          priv->hal.host->cmd_pkt_status.gen_buff_pld_empty)
        {
          break;
        }

      up_udelay(100);
    }

  if (elapsed >= DSI_CMD_TIMEOUT_US)
    {
      ret = -ETIMEDOUT;
    }

  nxmutex_unlock(&priv->lock);

  return ret;
}

/****************************************************************************
 * Name: esp32p4_mipi_dsi_read_dcs
 ****************************************************************************/

int esp32p4_mipi_dsi_read_dcs(uint8_t vc, uint8_t cmd,
                              FAR void *param, uint16_t param_size)
{
  FAR struct esp32p4_dsi_dev_s *priv = &g_dsi_dev;

  if (!priv->initialized || param == NULL)
    {
      return -EINVAL;
    }

  nxmutex_lock(&priv->lock);
  mipi_dsi_hal_host_gen_read_dcs_command(&priv->hal, vc, cmd, 1,
                                         param, param_size);
  nxmutex_unlock(&priv->lock);

  return OK;
}

/****************************************************************************
 * Name: esp32p4_mipi_dsi_set_framebuffer
 ****************************************************************************/

int esp32p4_mipi_dsi_set_framebuffer(uintptr_t fb_addr, size_t fb_size)
{
  FAR struct esp32p4_dsi_dev_s *priv = &g_dsi_dev;
  int ret;

  if (!priv->initialized || fb_addr == 0 || fb_size == 0)
    {
      return -EINVAL;
    }

  nxmutex_lock(&priv->lock);
  priv->fb_mem  = (FAR uint8_t *)fb_addr;
  priv->fb_size = fb_size;
  esp_cache_msync(priv->fb_mem, priv->fb_size,
                  ESP_CACHE_MSYNC_FLAG_DIR_C2M);
  ret = esp32p4_dsi_configure_dma(priv);
  nxmutex_unlock(&priv->lock);

  return ret;
}

/****************************************************************************
 * Name: esp32p4_mipi_dsi_start_video
 ****************************************************************************/

int esp32p4_mipi_dsi_start_video(void)
{
  FAR struct esp32p4_dsi_dev_s *priv = &g_dsi_dev;
  int ret;

  if (!priv->initialized)
    {
      return -EPERM;
    }

  nxmutex_lock(&priv->lock);

  if (!priv->dma_initialized)
    {
      ret = esp32p4_dsi_configure_dma(priv);
      if (ret < 0)
        {
          nxmutex_unlock(&priv->lock);
          return ret;
        }
    }

  /* Start memory-to-DSI transfer before enabling DPI output. */

  dw_gdma_ll_channel_enable(priv->dma_hal.dev, DSI_DMA_CHANNEL, true);
  mipi_dsi_host_ll_enable_video_mode(priv->hal.host, true);
  mipi_dsi_brg_ll_enable(priv->hal.bridge, true);
  mipi_dsi_brg_ll_enable_dpi_output(priv->hal.bridge, true);
  mipi_dsi_brg_ll_update_dpi_config(priv->hal.bridge);

  priv->streaming = true;
  nxmutex_unlock(&priv->lock);

  ginfo("ESP32-P4 MIPI DSI Video Stream started [OK]\n");
  return OK;
}

/****************************************************************************
 * Name: esp32p4_mipi_dsi_stop_video
 ****************************************************************************/

int esp32p4_mipi_dsi_stop_video(void)
{
  FAR struct esp32p4_dsi_dev_s *priv = &g_dsi_dev;

  if (!priv->initialized)
    {
      return -EPERM;
    }

  nxmutex_lock(&priv->lock);
  mipi_dsi_brg_ll_enable_dpi_output(priv->hal.bridge, false);
  mipi_dsi_brg_ll_update_dpi_config(priv->hal.bridge);
  mipi_dsi_brg_ll_enable(priv->hal.bridge, false);
  mipi_dsi_host_ll_enable_video_mode(priv->hal.host, false);
  if (priv->dma_initialized)
    {
      dw_gdma_ll_channel_enable(priv->dma_hal.dev, DSI_DMA_CHANNEL, false);
    }

  priv->streaming = false;
  nxmutex_unlock(&priv->lock);

  return OK;
}

/****************************************************************************
 * Name: esp32p4_mipi_dsi_dump
 ****************************************************************************/

void esp32p4_mipi_dsi_dump(void)
{
  FAR struct esp32p4_dsi_dev_s *priv = &g_dsi_dev;
  FAR dw_gdma_dev_t *dma = priv->dma_hal.dev;

  printf("=== ESP32-P4 MIPI DSI ===\n");
  printf("state init=%d stream=%d dma=%d fb=%p bytes=%zu\n",
         priv->initialized, priv->streaming, priv->dma_initialized,
         priv->fb_mem, priv->fb_size);
  if (priv->hal.host != NULL)
    {
      printf("host version=%08" PRIx32 " pwr=%08" PRIx32
             " mode=%08" PRIx32 " vid=%08" PRIx32 "\n",
             priv->hal.host->version.val, priv->hal.host->pwr_up.val,
             priv->hal.host->mode_cfg.val,
             priv->hal.host->vid_mode_cfg.val);
      printf("host phy=%08" PRIx32 " cmd=%08" PRIx32
             " int0=%08" PRIx32 " int1=%08" PRIx32 "\n",
             priv->hal.host->phy_status.val,
             priv->hal.host->cmd_pkt_status.val,
             priv->hal.host->int_st0.val,
             priv->hal.host->int_st1.val);
    }

  if (priv->hal.bridge != NULL)
    {
      printf("brg clk=%08" PRIx32 " en=%08" PRIx32
             " flow=%08" PRIx32 " dpi=%08" PRIx32 "\n",
             priv->hal.bridge->clk_en.val, priv->hal.bridge->en.val,
             priv->hal.bridge->dma_flow_ctrl.val,
             priv->hal.bridge->dpi_misc_config.val);
      printf("brg depth=%08" PRIx32 " raw=%08" PRIx32
             " st=%08" PRIx32 " bits=%08" PRIx32 "\n",
             priv->hal.bridge->fifo_flow_status.val,
             priv->hal.bridge->int_raw.val, priv->hal.bridge->int_st.val,
             priv->hal.bridge->blk_raw_num_cfg.val);
    }

  if (dma != NULL)
    {
      printf("dma chen=%08" PRIx32 " sar=%08" PRIx32
             " dar=%08" PRIx32 " ts=%08" PRIx32 "\n",
             dma->chen0.val, dma->ch[DSI_DMA_CHANNEL].sar0.sar0,
             dma->ch[DSI_DMA_CHANNEL].dar0.dar0,
             (uint32_t)dma->ch[DSI_DMA_CHANNEL].block_ts0.block_ts);
      printf("dma ctl0=%08" PRIx32 " ctl1=%08" PRIx32
             " cfg0=%08" PRIx32 " cfg1=%08" PRIx32
             " istat=%08" PRIx32 "\n",
             dma->ch[DSI_DMA_CHANNEL].ctl0.val,
             dma->ch[DSI_DMA_CHANNEL].ctl1.val,
             dma->ch[DSI_DMA_CHANNEL].cfg0.val,
             dma->ch[DSI_DMA_CHANNEL].cfg1.val,
             dw_gdma_ll_channel_get_intr_status(dma, DSI_DMA_CHANNEL));
    }

  printf("==========================\n");
}

/****************************************************************************
 * Name: esp32p4_fb_initialize
 ****************************************************************************/

FAR struct fb_vtable_s *esp32p4_fb_initialize(int display)
{
  FAR struct esp32p4_dsi_dev_s *priv = &g_dsi_dev;
  uint8_t bytes_per_pixel;

  if (display != 0)
    {
      return NULL;
    }

