uleemos/nuttx/arch/risc-v/src/esp32p4/esp32p4_mipi_dsi.c
  bytes_per_pixel = (priv->config.color_format ==
                     ESP32P4_DSI_COLOR_RGB888) ? 3 : 2;

  if (priv->fb_mem == NULL && priv->config.timing.width > 0 &&
      priv->config.timing.height > 0)
    {
      priv->fb_size = priv->config.timing.width *
                      priv->config.timing.height * bytes_per_pixel;
      priv->fb_mem  = (FAR uint8_t *)kumm_memalign(64, priv->fb_size);
      if (priv->fb_mem != NULL)
        {
          memset(priv->fb_mem, 0, priv->fb_size);
          esp_cache_msync((void *)priv->fb_mem, priv->fb_size,
                          ESP_CACHE_MSYNC_FLAG_DIR_C2M);
          if (priv->initialized)
            {
              esp32p4_dsi_configure_dma(priv);
            }
        }
    }

  return &priv->vtable;
}

/****************************************************************************
 * Name: up_fbinitialize
 ****************************************************************************/

int up_fbinitialize(int display)
{
  return (esp32p4_fb_initialize(display) != NULL) ? OK : -ENODEV;
}

/****************************************************************************
 * Name: up_fbgetvplane
 ****************************************************************************/

FAR struct fb_vtable_s *up_fbgetvplane(int display, int plane)
{
  if (display != 0 || plane != 0)
    {
      return NULL;
    }

  return esp32p4_fb_initialize(display);
}

/****************************************************************************
 * Name: up_fbuninitialize
 ****************************************************************************/

void up_fbuninitialize(int display)
{
  FAR struct esp32p4_dsi_dev_s *priv = &g_dsi_dev;

  if (display == 0 && priv->fb_mem != NULL)
    {
      kmm_free(priv->fb_mem);
      priv->fb_mem = NULL;
      priv->fb_size = 0;
    }
}
